Revit 2024 API
FailureHandlingOptions.SetTransactionFinalizer Method
 Sets the callback to be executed after the transaction is completed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureHandlingOptions SetTransactionFinalizer(
	ITransactionFinalizer finalizer
)
Visual Basic
Public Function SetTransactionFinalizer ( _
	finalizer As ITransactionFinalizer _
) As FailureHandlingOptions
Visual C++
public:
FailureHandlingOptions^ SetTransactionFinalizer(
	ITransactionFinalizer^ finalizer
)
Parameters
finalizer
Type: Autodesk.Revit.DB.ITransactionFinalizer
 The callback to be executed after the transaction is completed.
Return Value
 This FailureHandlingOptions object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace